## 1. Age

According to Santander Cycles Survey of Q2 2017/2018 their main target group depicts of people of between the age 16 and 54.<br>
They group their customers in the following age groups:

![](img/target.png)

As this plot shows they have more male users than female users, why we give maless a higher weight than females.<br>
Moreover we should weight the several age groups differently.

Appropriate data was found at the [Office for National Statistics](https://www.ons.gov.uk/peoplepopulationandcommunity/populationandmigration/populationestimates/datasets/populationestimatesforukenglandandwalesscotlandandnorthernireland).

After preparing the data in a first way we have the age groups ordered by London districts:

In [2]:
import pandas as pd

In [4]:
age = pd.read_csv("age.csv")
age.head()

                     Name  All ages  25-34  35-44  45-54  55-64    >65
0                  Camden    253361  54527  39552  30599  21676  30098
1          City of London      7654   1050   1002   1255   1024   1482
2                 Hackney    275929  70473  49206  31106  20243  20394
3  Hammersmith and Fulham    182998  40080  30736  24184  15855  19334
4                Haringey    271224  52469  48048  36933  24046  26628